# SetSymDefSubType

## Description
Sets the sub type for a symbol definition that is used to define a plug-in style.

```pascal
PROCEDURE SetSymDefSubType(
				hSymDef : HANDLE;
				subType : INTEGER);
```

```python
def vs.SetSymDefSubType(hSymDef, subType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSymDef|HANDLE|Handle to symbol definition that is being used to define a plug-in style.|
|subType|INTEGER|Sub type identifier to set for the symbol definition.|

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Symbols